import { Locale } from "../../settings/utils/Locale";

export const QUESTIONS_KO = [
  "처음 만났던 날, 우리는 어떻게 가족이 되었나요?",
  "{{name}} 이름의 뜻은 무엇인가요?",
  "처음 집에 왔을 때, {{name}}은 어떤 모습을 보였나요?",
  "처음 함께했던 밤, {{name}}은 어디에서 잠들었나요?",
  "{{name}}을 처음 씻겼을 때, 어떤 반응을 보였나요?",
  "아침에 일어났을 때, {{name}}은 보통 무엇을 하고 있었나요?",
  "외출했다 돌아왔을 때, {{name}}의 반응은 보통 어땠나요?",
  "{{name}}이 가장 좋아했던 장소는 어디였나요?",
  "{{name}}이 가장 좋아했던 장난감이나 놀이는 무엇인가요?",
  "{{name}}은 어떤 간식을 제일 좋아했나요?",
  "{{name}}이 나를 놀라게 했던 순간이 있었나요?",
  "{{name}} 때문에 너무나 웃겼던 순간이 있나요?",
  "{{name}}이 사고를 쳐서 난감했던 순간이 있었나요?",
  "{{name}}이 나에게 예상치 못한 감동을 준 순간이 있었나요?",
  "{{name}}이 좋아했던 주변인이나 캐릭터가 있다면 소개해주세요!",
  "맛있는 간식이 먹고 싶은 {{name}}, 어떤 표현이나 행동을 할까요?",
  "잠자리에 들기 전에 {{name}}이 꼭 하던 행동이 있었나요?",
  "{{name}}이 나를 깨울 때 어떻게 했나요?",
  "{{name}}이 갑자기 사라졌다! 우리 친구는 어디에 숨어 있었나요?",
  "내 {{name}}만의 특별한 성격이나 특징은 무엇인가요?",
  "잘난 우리 친구의 얼굴에서 가장 귀여운 부분을 자랑해주세요!",
  "내 {{name}}은 내향 vs 외향? 그리고 그렇게 생각한 이유는 무엇인가요?",
  "{{name}}은 기분이 좋을 때, 어떤 행동으로 표현했나요?",
  "{{name}}은 화가 나거나 심통이 났을 때는 어떻게 표현했나요?",
  "{{name}}만의 특별한 습관이나 버릇은 무엇인가요?",
  "{{name}}은 하루 중 어느 시간대를 가장 좋아했나요? 그 이유는 무엇인가요?",
  "{{name}}은 나에게 어떤 방식으로 애정을 표현했나요?",
  "내가 {{name}}을 쓰다듬을 때, 가장 좋아했던 부위는 어디였나요?",
  "{{name}}이 나를 위로해준 순간이 있었나요?",
  "사랑스러운 우리 친구의 생일! 특별히 준비하거나 해준 일들이 있나요?",
  "{{name}}과 함께 있으면 자연스럽게 하게 되는 행동이 있었나요?",
  "{{name}}과 가장 행복했던 순간을 하나 꼽는다면 언제인가요?",
  "{{name}}이 내게 특별한 선물을 주었던 적이 있나요?",
  "지금 당장 떠오르는 {{name}}과의 추억을 소개해주세요!",
  "사춘기 시절 우리 친구가 피웠던 가장 큰 말썽은 무엇인가요?",
  "가장 잘 나온 {{name}}의 사진을 자랑해주세요!",
  "{{name}}은 어떤 방식으로 나에게 말을 걸었나요?",
  "내가 {{name}}를 부를 때, 어떤 반응을 보였나요?",
  "{{name}}과 내가 꼭 같이 하는 일들은 어떤 게 있었나요?",
  "{{name}}이 내 기분을 먼저 알아차린 적이 있었나요?",
  "우리 친구가 삐졌어요! 삐진 {{name}}을 풀어주는 당신만의 비법이 있나요?",
  "{{name}}과 함께했던 순간 중 가장 소중했던 장면은 무엇인가요?",
  "{{name}}과 함께한 날들 중, 다시 한번 돌아가고 싶은 하루가 있다면 언제인가요?",
  "언젠가 다시 만난다면, 가장 먼저 해주고 싶은 말은 무엇인가요?",
  "{{name}}이 나를 어떤 사람으로 기억했으면 하나요?",
  "{{name}}과 함께하기 전과 후, 내 자신이 달라진 점은 무엇인가요?",
  "{{name}}이 내게 가르쳐준 가장 소중한 것은 무엇인가요?",
  "{{name}}과 함께한 시간을 한 마디로 표현한다면?",
  "마지막으로 {{name}}에게 마지막으로 전하고 싶은 말은 무엇인가요?",
];

export const QUESTIONS_EN = [""];

export const QUESTIONS_ZH = [""];

export const QUESTIONS_JA = [""];

export const QUESTIONS_SIZE = 49;

export const QUESTIONS: Record<Locale, string[]> = {
  ko: QUESTIONS_KO,
  en: QUESTIONS_EN,
  ja: QUESTIONS_JA,
  zh: QUESTIONS_ZH,
};
